app/controllers/api/v1/sfs_controller.rb

SELECT "file_names".* FROM "file_names" ORDER BY "file_names"."created_at" DESC
---
      def index
        @files = FileName.all.order(created_at: 'desc')